amarildolacerda/homeware/clients/esp8266_onoff/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ArduinoJson.h>
#include <EEPROM.h>
#include <ArduinoOTA.h>
#include <Updater.h>
#include <espnow.h>
#include <Espalexa.h>
#include <sys/time.h>
#include "config.h"
#include "pages.h"
#include "espnow_protocol.h"
#include "common_console.h"
#include "common_espnow.h"
#include "common_web.h"
#include "common_repeater.h"
#include "timer.h"
#include <LittleFS.h>

static const char *TAG = "esp8266-onoff";

static unsigned long s_last_state_update = 0;
static unsigned long s_last_telemetry_update = 0;
static unsigned long s_last_reconnect_attempt = 0;
static unsigned long s_last_espnow_send = 0;
static unsigned long s_last_espnow_pair = 0;
static unsigned long s_last_heartbeat = 0;
static unsigned long s_last_alexa_activity = 0;
static unsigned long s_send_deadline = 0;
static int s_send_retries_left = 0;
static unsigned long s_pair_wait_until = 0;

static bool s_gateway_connected = false;
static bool s_paired = false;
static uint8_t s_gateway_mac[6];

static bool mac_is_nonzero(const uint8_t *mac) {
    return mac[0] || mac[1] || mac[2] || mac[3] || mac[4] || mac[5];
}
static uint16_t s_sequence = 0;
static uint16_t s_assigned_slot = 0;
static int s_pair_attempts = 0;
static bool s_ack_received = false;
static bool s_send_pending = false;
static bool s_espnow_ready = false;

static bool s_relay_state = false;
static int s_relay_pin = RELAY_PIN;
static int s_button_pin = BUTTON_PIN;
static int s_battery = 100;
static bool s_button_last = HIGH;
static unsigned long s_button_last_ms = 0;
static unsigned long s_start_time = 0;
static unsigned long s_last_send_ms = 0;
static uint32_t s_espnow_tx_count = 0;
static uint32_t s_espnow_rx_count = 0;
static uint32_t s_on_count = 0;

static char s_device_id[32];
static char s_device_name[32] = DEVICE_NAME;

static unsigned long s_wifi_config_start_time = 0;
static bool s_config_portal_active = false;
static bool s_led_enabled = true;
static int s_startup_mode = 0; // 0=OFF, 1=ON, 2=LAST
static uint8_t s_my_mac[6];
static unsigned long s_wifi_connect_start = 0;
static bool s_wifi_connected = false;

static ESP8266WebServer s_server(DASHBOARD_PORT);
static Espalexa s_alexa;
static EspalexaDevice *s_alexa_dev = nullptr;

static uint8_t s_broadcast_mac[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
static unsigned long s_last_timer_check = 0;
static unsigned long s_last_cyclic_check = 0;
static int s_timezone_offset = -3;
static unsigned long s_synced_epoch = 0;

static unsigned long get_synced_epoch(void) {
    time_t t = time(NULL);
    if (t > 100000) return (unsigned long)t;
    if (s_synced_epoch > 0)
        return s_synced_epoch + (millis() / 1000);
    return 0;
}


// D1-MINI é invtido
#define LED_ON  LOW   // GPIO2 acende com LOW
#define LED_OFF HIGH  // GPIO2 apaga com HIGH


#define EEPROM_GATEWAY_MAC_ADDR 0
#define EEPROM_GATEWAY_MAC_SIZE 6
#define EEPROM_NAME_ADDR 10
#define EEPROM_NAME_MAX 48
#define EEPROM_RELAY_STATE_ADDR (EEPROM_NAME_ADDR + EEPROM_NAME_MAX + 1)
#define EEPROM_RELAY_PIN_ADDR (EEPROM_RELAY_STATE_ADDR + 1)
#define EEPROM_BUTTON_PIN_ADDR (EEPROM_RELAY_PIN_ADDR + 1)
#define EEPROM_LED_ENABLED_ADDR (EEPROM_BUTTON_PIN_ADDR + 1)
#define EEPROM_STARTUP_MODE_ADDR (EEPROM_LED_ENABLED_ADDR + 1)
#define EEPROM_SSID_ADDR 64
#define EEPROM_SSID_MAX 32
#define EEPROM_PASS_ADDR (EEPROM_SSID_ADDR + EEPROM_SSID_MAX)
#define EEPROM_PASS_MAX 64
#define EEPROM_MAGIC 0xAA

static bool s_pulse_enabled = false;
static uint16_t s_pulse_duration_min = PULSE_DEFAULT_DURATION_MIN;
static unsigned long s_pulse_on_time = 0;

static void set_relay(bool state);
static bool espnow_send_data(void);

static void on_timer_fire(uint8_t action)
{
    console.printf("[%s] Timer fired: action=%d\n", TAG, action);
    set_relay(action ? true : false);
    if (s_paired)
    {
        s_last_espnow_send = 0;
        espnow_send_data();
    }
}

static void save_relay_state(void)
{
    EEPROM.begin(EEPROM_SIZE);
    EEPROM.write(EEPROM_RELAY_STATE_ADDR, s_relay_state ? 1 : 0);
    EEPROM.commit();
    EEPROM.end();
}

static void load_relay_state(void)
{
    EEPROM.begin(EEPROM_SIZE);
    uint8_t val = EEPROM.read(EEPROM_RELAY_STATE_ADDR);
    EEPROM.end();
    s_relay_state = (val == 1);
}

static void save_relay_pin(void)
{
    EEPROM.begin(EEPROM_SIZE);
    EEPROM.write(EEPROM_RELAY_PIN_ADDR, (uint8_t)s_relay_pin);
    EEPROM.commit();
    EEPROM.end();
}

static void load_relay_pin(void)
{
    EEPROM.begin(EEPROM_SIZE);
    uint8_t val = EEPROM.read(EEPROM_RELAY_PIN_ADDR);
    EEPROM.end();
    if (val != 0xFF)
    {
        for (int i = 0; i < AVAILABLE_GPIOS_COUNT; i++)
        {
            if (AVAILABLE_GPIOS[i] == (int)val)
            {
                s_relay_pin = (int)val;
                return;
            }
        }
    }
}

static void save_button_pin(void)
{
    EEPROM.begin(EEPROM_SIZE);
    EEPROM.write(EEPROM_BUTTON_PIN_ADDR, (uint8_t)s_button_pin);
    EEPROM.commit();
    EEPROM.end();
}

static void load_button_pin(void)
{
    EEPROM.begin(EEPROM_SIZE);
    uint8_t val = EEPROM.read(EEPROM_BUTTON_PIN_ADDR);
    EEPROM.end();
    if (val != 0xFF)
    {
        for (int i = 0; i < AVAILABLE_GPIOS_COUNT; i++)
        {
            if (AVAILABLE_GPIOS[i] == (int)val)
            {
                s_button_pin = (int)val;
                return;
            }
        }
    }
}

static void save_led_enabled(void)
{
    EEPROM.begin(EEPROM_SIZE);
    EEPROM.write(EEPROM_LED_ENABLED_ADDR, s_led_enabled ? 1 : 0);
    EEPROM.commit();
    EEPROM.end();
}

static void load_led_enabled(void)
{
    EEPROM.begin(EEPROM_SIZE);
    uint8_t val = EEPROM.read(EEPROM_LED_ENABLED_ADDR);
    EEPROM.end();
    if (val == 0)
        s_led_enabled = false;
    else
        s_led_enabled = true;
}

static void save_startup_mode(void)
{
    EEPROM.begin(EEPROM_SIZE);
    EEPROM.write(EEPROM_STARTUP_MODE_ADDR, (uint8_t)s_startup_mode);
    EEPROM.commit();
    EEPROM.end();
}

static void load_startup_mode(void)
{
    EEPROM.begin(EEPROM_SIZE);
    uint8_t val = EEPROM.read(EEPROM_STARTUP_MODE_ADDR);
    EEPROM.end();
    if (val <= 2)
        s_startup_mode = (int)val;
    else
        s_startup_mode = 0;
}

static void save_wifi_credentials(const char *ssid, const char *pass)
{
    EEPROM.begin(EEPROM_SIZE);
    EEPROM.write(EEPROM_SSID_ADDR, 0xFF);
    EEPROM.write(EEPROM_PASS_ADDR, 0xFF);
    for (int i = 0; i < EEPROM_SSID_MAX - 1; i++)
    {
        EEPROM.write(EEPROM_SSID_ADDR + 1 + i, ssid[i]);
        if (ssid[i] == '\0')
            break;
    }
    EEPROM.write(EEPROM_SSID_ADDR + EEPROM_SSID_MAX - 1, '\0');
    for (int i = 0; i < EEPROM_PASS_MAX - 1; i++)
    {
        EEPROM.write(EEPROM_PASS_ADDR + 1 + i, pass[i]);
        if (pass[i] == '\0')
            break;
    }
    EEPROM.write(EEPROM_PASS_ADDR + EEPROM_PASS_MAX - 1, '\0');
    EEPROM.commit();
    EEPROM.end();
}

static bool load_wifi_credentials(char *ssid, size_t ssid_size, char *pass, size_t pass_size)
{
    EEPROM.begin(EEPROM_SIZE);
    uint8_t marker = EEPROM.read(EEPROM_SSID_ADDR);
    bool found = false;
    if (marker == 0xFF)
    {
        char buf[64];
        for (int i = 0; i < EEPROM_SSID_MAX - 1; i++)
        {
            buf[i] = EEPROM.read(EEPROM_SSID_ADDR + 1 + i);
            if (buf[i] == '\0')
                break;
        }
        buf[EEPROM_SSID_MAX - 1] = '\0';
        if (strlen(buf) > 0)
        {
            strncpy(ssid, buf, ssid_size - 1);
            ssid[ssid_size - 1] = '\0';
            found = true;
        }
        marker = EEPROM.read(EEPROM_PASS_ADDR);
        if (marker == 0xFF)
        {
            for (int i = 0; i < EEPROM_PASS_MAX - 1; i++)
            {
                buf[i] = EEPROM.read(EEPROM_PASS_ADDR + 1 + i);
                if (buf[i] == '\0')
                    break;
            }
            buf[EEPROM_PASS_MAX - 1] = '\0';
            strncpy(pass, buf, pass_size - 1);
            pass[pass_size - 1] = '\0';
        }
    }
    EEPROM.end();
    return found;
}

static void set_relay(bool state);

static void name_to_ssid(const char *name, char *out, size_t max)
{
    size_t j = 0;
    for (size_t i = 0; name[i] && j < max - 1; i++)
    {
        char c = name[i];
        if (c >= 32 && c <= 126 && c != '"' && c != '\\')
            out[j++] = c;
    }
    while (j > 0 && out[j - 1] == ' ')
        j--;
    if (j == 0)
    {
        strncpy(out, "OnOff", max - 1);
        out[max - 1] = '\0';
        return;
    }
    out[j] = '\0';
}

extern "C" void espnow_send_cb(uint8_t *mac, uint8_t status)
{
    s_espnow_tx_count++;
    if (status != 0)
    {
        char mac_str[18];
        mac_to_str(mac, mac_str, sizeof(mac_str));
        console.printf("[%s] ESPNOW send failed to %s: status=%d\n", TAG, mac_str, status);
    }
}

static bool espnow_send_heartbeat(void);

static void espnow_send_fn(const uint8_t *mac, const uint8_t *data, int len, const char *tag)
{
    espnow_send_wrapper(mac, data, (size_t)len, tag);
}

extern "C" void espnow_recv_cb(uint8_t *mac, uint8_t *data, uint8_t len)
{
    s_espnow_rx_count++;
    if (!data || len < 1)
        return;

    switch (data[0])
    {
    case ESPNOW_MSG_PAIR_RESPONSE:
    {
        if (len < sizeof(espnow_pair_response_t))
            return;
        espnow_pair_response_t *resp = (espnow_pair_response_t *)data;
        if (mac_is_nonzero(s_gateway_mac) && !mac_equal(mac, s_gateway_mac))
            return;
        if (resp->status == PAIR_STATUS_OK)
        {
            if (!repeater_is_enabled())
            {
                mac_copy(s_gateway_mac, mac);
                espnow_save_gateway_mac(mac, TAG);
            }
            s_assigned_slot = resp->assigned_slot;
            s_paired = true;
            s_gateway_connected = true;
            char mac_str[18];
            mac_to_str(mac, mac_str, sizeof(mac_str));
            console.printf("[%s] Paired with gateway %s slot %d\n", TAG, mac_str, s_assigned_slot);
        }
        else
        {
            console.printf("[%s] Pair response: status=%d\n", TAG, resp->status);
        }
        break;
    }
    case ESPNOW_MSG_COMMAND:
    {
        if (len < sizeof(espnow_command_t))
            return;
        if (!mac_equal(mac, s_gateway_mac))
            return;
        espnow_command_t *cmd = (espnow_command_t *)data;
        if (mac_equal(cmd->target_mac, s_my_mac))
        {
            console.printf("[%s] Command for me: state=%d\n", TAG, cmd->command);
            set_relay(cmd->command ? true : false);
        }
        break;
    }
    case ESPNOW_MSG_RESTART:
    {
        if (len < sizeof(espnow_restart_t)) return;
        if (!mac_equal(mac, s_gateway_mac)) return;
        espnow_restart_t *rst = (espnow_restart_t *)data;
        if (mac_equal(rst->target_mac, s_my_mac))
        {
            console.printf("[%s] Restart command received, rebooting...\n", TAG);
            if (s_paired) {
                espnow_send_heartbeat();
                delay(50);
            }
            delay(100);
            ESP.restart();
        }
        break;
    }
    case ESPNOW_MSG_NAK:
    {
        if (len < sizeof(espnow_nak_t)) return;
        if (!mac_equal(mac, s_gateway_mac)) return;
        espnow_nak_t *nak = (espnow_nak_t *)data;
        if (nak->reason == NAK_REASON_GATEWAY_LOST)
        {
            console.printf("[%s] Gateway lost notification (NAK), re-pairing...\n", TAG);
            s_paired = false;
            s_gateway_connected = false;
            s_pair_attempts = 0;
        }
        break;
    }
    case ESPNOW_MSG_TIME_SYNC:
    {
        if (len < sizeof(espnow_time_sync_t))
            return;
        if (!mac_equal(mac, s_gateway_mac))
            return;
        espnow_time_sync_t *ts = (espnow_time_sync_t *)data;
        s_synced_epoch = ts->epoch_seconds;
        struct timeval tv = { (time_t)s_synced_epoch, 0 };
        settimeofday(&tv, NULL);
        console.printf("[%s] Time sync: epoch=%lu seq=%d\n", TAG, s_synced_epoch, ts->sequence);
        break;
    }
    case ESPNOW_MSG_ACK:
    {
        if (len < sizeof(espnow_ack_t))
            return;
        espnow_ack_t *ack = (espnow_ack_t *)data;
        console.printf("[%s] ACK received: status=%d seq=%d slot=%d\n", TAG, ack->status, ack->sequence, ack->assigned_slot);
        if (ack->status == PAIR_STATUS_DENIED)
        {
            s_paired = false;
            s_gateway_connected = false;
            console.printf("[%s] Gateway rejected data (denied), need re-pair\n", TAG);
        }
        else
        {
            s_gateway_connected = true;
        }
        s_ack_received = true;
        break;
    }
    }

    /* Repeater: forward messages between clients and gateway */
    if (s_paired && repeater_is_enabled())
    {
        repeater_forward(mac, data, len, s_gateway_mac, s_broadcast_mac, espnow_send_fn, TAG);
    }
}

