amarildolacerda/homeware/clients/esp8266_onoff/src/main.cpp
#define ESPNOW_HEADER_FIXED_SIZE (sizeof(espnow_header_t) - sizeof(((espnow_header_t *)0)->payload))

static bool espnow_send_data(void)
{
    if (!s_paired || !s_espnow_ready)
        return false;

    uint8_t buf[ESPNOW_HEADER_FIXED_SIZE + sizeof(payload_onoff_t) + 4 + 2];
    memset(buf, 0, sizeof(buf));

    espnow_header_t *hdr = (espnow_header_t *)buf;
    hdr->version = ESPNOW_PROTOCOL_VERSION;
    hdr->msg_type = ESPNOW_MSG_SENSOR_DATA;
    hdr->sequence = s_sequence++;
    WiFi.macAddress(hdr->sensor_mac);
    hdr->sensor_type = SENSOR_TYPE_ONOFF;
    hdr->battery_pct = (uint8_t)s_battery;
    hdr->rssi = (int16_t)WiFi.RSSI();

    payload_onoff_t *pl = (payload_onoff_t *)hdr->payload;
    pl->state = s_relay_state ? 1 : 0;

    IPAddress ip = WiFi.localIP();
    uint8_t *ip_ptr = hdr->payload + sizeof(payload_onoff_t);
    ip_ptr[0] = ip[0];
    ip_ptr[1] = ip[1];
    ip_ptr[2] = ip[2];
    ip_ptr[3] = ip[3];

    uint16_t free_heap = ESP.getFreeHeap();
    uint8_t *fh_ptr = hdr->payload + sizeof(payload_onoff_t) + 4;
    fh_ptr[0] = free_heap & 0xFF;
    fh_ptr[1] = (free_heap >> 8) & 0xFF;

    hdr->payload_len = sizeof(payload_onoff_t) + 4 + 2;

    if (!espnow_client_add_peer(s_gateway_mac, TAG))
    {
        console.printf("[%s] Failed to add gateway peer\n", TAG);
        return false;
    }

    s_ack_received = false;
    s_send_pending = true;
    if (!espnow_send_wrapper(s_gateway_mac, buf, sizeof(buf), TAG))
    {
        s_send_pending = false;
        return false;
    }
    return true;
}

static bool espnow_send_heartbeat(void)
{
    if (!s_paired || !s_espnow_ready)
        return false;

    uint8_t buf[ESPNOW_HEADER_FIXED_SIZE];
    memset(buf, 0, sizeof(buf));

    espnow_header_t *hdr = (espnow_header_t *)buf;
    hdr->version = ESPNOW_PROTOCOL_VERSION;
    hdr->msg_type = ESPNOW_MSG_HEARTBEAT;
    hdr->sequence = s_sequence++;
    WiFi.macAddress(hdr->sensor_mac);
    hdr->sensor_type = SENSOR_TYPE_ONOFF;
    hdr->battery_pct = (uint8_t)s_battery;
    hdr->rssi = (int16_t)WiFi.RSSI();
    hdr->payload_len = 0;

    if (!espnow_client_add_peer(s_gateway_mac, TAG))
        return false;

    s_ack_received = false;
    return espnow_send_wrapper(s_gateway_mac, buf, sizeof(buf), TAG);
}

static bool espnow_send_pair_request(void)
{
    if (!s_espnow_ready)
        return false;

    uint8_t buf[sizeof(espnow_pair_request_t)];
    memset(buf, 0, sizeof(buf));

    espnow_pair_request_t *req = (espnow_pair_request_t *)buf;
    req->msg_type = ESPNOW_MSG_PAIR_REQUEST;
    req->sequence = s_sequence++;
    WiFi.macAddress(req->sensor_mac);
    req->sensor_type = SENSOR_TYPE_ONOFF;
    uint32_t ver = 0x000A000B;
    req->firmware_version[0] = (uint8_t)(ver >> 24);
    req->firmware_version[1] = (uint8_t)(ver >> 16);
    req->firmware_version[2] = (uint8_t)(ver >> 8);
    req->firmware_version[3] = (uint8_t)(ver);
    strncpy(req->device_name, s_device_name, sizeof(req->device_name) - 1);
    req->device_name[sizeof(req->device_name) - 1] = '\0';

    if (!espnow_client_add_peer(s_broadcast_mac, TAG))
        return false;

    s_ack_received = false;
    return espnow_send_wrapper(s_broadcast_mac, buf, sizeof(buf), TAG);
}

static void set_relay(bool state)
{
    if (state && !s_relay_state)
        s_on_count++;
    s_relay_state = state;
    digitalWrite(s_relay_pin, state ? RELAY_ON : !RELAY_ON);
    save_relay_state();
    if (state && s_pulse_enabled)
        s_pulse_on_time = millis();
    if (!state)
        cyclic_reset();
    s_last_espnow_send = 0;
}

static void toggle_relay(void)
{
    set_relay(!s_relay_state);
}

static void alexa_callback(EspalexaDevice *d)
{
    bool state = (d->getValue() > 0);
    s_last_alexa_activity = millis();
    console.printf("[%s] Alexa: %s -> %s\n", TAG, s_device_name, state ? "ON" : "OFF");
    set_relay(state);
    if (s_paired)
    {
        s_last_espnow_send = 0;
        espnow_send_data();
    }
}

static void init_hardware(void)
{
    load_relay_pin();
    load_button_pin();
    load_led_enabled();
    load_startup_mode();
    pinMode(s_relay_pin, OUTPUT);
    if (s_startup_mode == 0)
    {
        s_relay_state = false;
    }
    else if (s_startup_mode == 1)
    {
        s_relay_state = true;
    }
    else
    {
        load_relay_state();
    }
    digitalWrite(s_relay_pin, s_relay_state ? RELAY_ON : !RELAY_ON);
    pinMode(s_button_pin, INPUT_PULLUP);
    s_button_last = digitalRead(s_button_pin);
#ifdef LED_PIN
    pinMode(LED_PIN, OUTPUT);
    digitalWrite(LED_PIN, LED_OFF);
#endif
}

static void start_ap(void)
{
    char ssid[33];
    name_to_ssid(s_device_name, ssid, sizeof(ssid));
    WiFi.softAP(ssid, WIFI_CONFIG_PORTAL_PASS);
    console.printf("[%s] AP '%s' started, connect to configure WiFi\n", TAG, ssid);
}

static void hwifi_begin(void)
{
    WiFi.mode(WIFI_AP_STA);
    WiFi.setOutputPower(20.5);

    if (WiFi.SSID().length() > 0)
    {
        console.printf("[%s] Saved SSID: %s, connecting...\n", TAG, WiFi.SSID().c_str());
        WiFi.begin();
        s_wifi_connect_start = millis();
        s_config_portal_active = false;
        return;
    }

    char ssid[EEPROM_SSID_MAX], pass[EEPROM_PASS_MAX];
    ssid[0] = '\0';
    pass[0] = '\0';
    if (load_wifi_credentials(ssid, sizeof(ssid), pass, sizeof(pass)))
    {
        console.printf("[%s] EEPROM SSID: %s, connecting...\n", TAG, ssid);
        WiFi.begin(ssid, pass);
        s_wifi_connect_start = millis();
        s_config_portal_active = false;
        return;
    }

    console.printf("[%s] No saved WiFi, starting AP config mode\n", TAG);
    s_config_portal_active = true;
    s_wifi_config_start_time = millis();
    start_ap();
}

static void wifi_reconnect(void)
{
    unsigned long now = millis();
    if (now - s_last_reconnect_attempt < 30000)
        return;
    s_last_reconnect_attempt = now;
    console.printf("[%s] WiFi disconnected. Reconnecting...\n", TAG);
    WiFi.reconnect();
}

static void handle_wifi(void)
{
    unsigned long now = millis();

