amarildolacerda/homeware/clients/esp8266_onoff/src/main.cpp
static void handle_api_restart(void)
{
    s_server.send(200, "application/json", "{\"status\":\"ok\"}");
    delay(500);
    ESP.restart();
}

static void handle_ota(void)
{
    if (!Update.hasError())
    {
        s_server.send(200, "application/json", "{\"status\":\"ok\"}");
        delay(500);
        ESP.restart();
    }
    else
    {
        s_server.send(500, "application/json", "{\"status\":\"error\"}");
    }
}

static void handle_ota_upload(void)
{
    HTTPUpload &upload = s_server.upload();
    if (upload.status == UPLOAD_FILE_START)
    {
        console.printf("[%s] OTA update started: %s (%d bytes)\n", TAG, upload.filename.c_str(), upload.totalSize);
        if (!Update.begin(upload.totalSize))
            Update.printError(Serial);
    }
    else if (upload.status == UPLOAD_FILE_WRITE)
    {
        if (Update.write(upload.buf, upload.currentSize) != upload.currentSize)
            Update.printError(Serial);
    }
    else if (upload.status == UPLOAD_FILE_END)
    {
        if (Update.end(true))
            console.printf("[%s] OTA update success: %d bytes\n", TAG, upload.totalSize);
        else
            Update.printError(Serial);
    }
}

void setup(void)
{
    Serial.begin(115200);
    delay(1000);
    console.begin();
    s_start_time = millis();

    uint32_t chip_id = ESP.getChipId();
    snprintf(s_device_id, sizeof(s_device_id), "esp8266_%06x", chip_id);

    espnow_load_device_name(s_device_name, sizeof(s_device_name));

    console.printf("\n");
    console.printf("============================================\n");
    console.printf("  ESP8266 OnOff " FW_VERSION "\n");
    console.printf("  Device: %s\n", s_device_id);
    console.printf("  Nome:   %s\n", s_device_name);
    console.printf("============================================\n");

    randomSeed(analogRead(A0));
    init_hardware();
    console.printf("============================================\n");

    hwifi_begin();

    s_espnow_ready = espnow_client_init(TAG);
    if (s_espnow_ready) {
        esp_now_register_send_cb(espnow_send_cb);
        esp_now_register_recv_cb(espnow_recv_cb);
    }
    WiFi.macAddress(s_my_mac);

    s_alexa_dev = new EspalexaDevice(s_device_name, alexa_callback, EspalexaDeviceType::onoff);
    s_alexa.addDevice(s_alexa_dev);
    s_alexa.begin(&s_server);
    console.printf("[%s] Alexa Hue Bridge: %s ready\n", TAG, s_device_name);

    s_server.on("/", handle_root);
    s_server.on("/docs", []()
                { serve_pgm_page(s_server, PAGE_DOCS); });
    s_server.on("/api/wifi", HTTP_ANY, handle_api_wifi);
    s_server.on("/api/state", handle_api_state);
    s_server.on("/api/relay", handle_api_relay);
    s_server.on("/api/pin", HTTP_ANY, []() { handle_api_pin(s_server); });
    s_server.on("/api/settings", HTTP_ANY, handle_api_settings);
    s_server.on("/api/restart", HTTP_POST, handle_api_restart);
    s_server.on("/api/ota", HTTP_POST, handle_ota, handle_ota_upload);
    s_server.on("/api/timers", HTTP_ANY, handle_api_timers);
    s_server.on("/api/timer/next", handle_api_timer_next);
    s_server.on("/api/pulse", HTTP_ANY, handle_api_pulse);
    /* s_server.begin() is called by Espalexa internally */

    ArduinoOTA.setHostname(s_device_id);
    ArduinoOTA.onStart([]()
                       { console.printf("[%s] OTA update start\n", TAG); });
    ArduinoOTA.onEnd([]()
                     { console.printf("[%s] OTA update end\n", TAG); });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
                          { console.printf("[%s] OTA progress: %u%%\r", TAG, (progress * 100) / total); });
    ArduinoOTA.onError([](ota_error_t error)
                       { console.printf("[%s] OTA error: %d\n", TAG, error); });
    ArduinoOTA.begin();
    console.printf("[%s] OTA ready: %s.local\n", TAG, s_device_id);

    console.printf("  => Terminal:  'h' comando de ajuda\n");

    LittleFS.begin();

    repeater_init(EEPROM_REPEATER_EN_ADDR);

    /* Check for REPEATER_MAC from config.h */
    if (strlen(REPEATER_MAC) > 0 && mac_parse(REPEATER_MAC, s_gateway_mac))
    {
        repeater_set_enabled(true);
        repeater_save_enable();
        s_paired = true;
        char mac_str[18];
        mac_to_str(s_gateway_mac, mac_str, sizeof(mac_str));
        console.printf("[%s] Using repeater MAC: %s\n", TAG, mac_str);
    }
    else if (espnow_load_gateway_mac(s_gateway_mac, TAG))
    {
        s_paired = true;
    }
    else
    {
        console.printf("[%s] No saved gateway MAC, will pair\n", TAG);
    }

    timer_init(EEPROM_TIMER_BASE, MAX_TIMERS);
    if (!timer_load_littlefs()) {
        timer_load();  /* EEPROM migration */
        timer_save_littlefs();
    }
    if (timer_load_littlefs()) {
        EEPROM.begin(EEPROM_SIZE);
        for (uint16_t i = 0; i < MAX_TIMERS * sizeof(timer_config_t); i++)
            EEPROM.write(EEPROM_TIMER_BASE + i, 0xFF);
        EEPROM.commit();
        EEPROM.end();
        console.printf("[%s] EEPROM timer region cleared\n", TAG);
    }
    console.printf("[%s] Timer module initialized (LittleFS)\n", TAG);

    s_pulse_enabled = timer_pulse_get_enabled();
    s_pulse_duration_min = timer_pulse_get_duration();
    console.printf("[%s] Pulse: %s (%d min)\n", TAG, s_pulse_enabled ? "ON" : "OFF", s_pulse_duration_min);

    console.printf("============================================\n");
    console.printf("  Pronto! Pressione 'h' para ajuda\n");
    console.printf("  Telnet: %s:23\n", WiFi.localIP().toString().c_str());
    console.printf("============================================\n\n");
}

void loop(void)
{
    console.loop();
    if (Serial.available() > 0)
    {
        handle_console(Serial.read());
    }
    if (console.telnet_available() > 0)
    {
        handle_console(console.telnet_read());
    }
    handle_wifi();
    ArduinoOTA.handle();
    s_alexa.loop();

    {
        bool btn = digitalRead(s_button_pin);
        unsigned long now = millis();
        if (btn != s_button_last && now - s_button_last_ms > 50)
        {
            s_button_last_ms = now;
            s_button_last = btn;
            if (btn == LOW)
            {
                toggle_relay();
                console.printf("[%s] Button press -> relay %s\n", TAG, s_relay_state ? "ON" : "OFF");
            }
        }
    }

    unsigned long now = millis();

