amarildolacerda/homeware/clients/esp8266_onoff/src/main.cpp
    if (!s_paired)
    {
        if (s_pair_wait_until > 0 && now < s_pair_wait_until)
            return;
        if (now - s_last_espnow_pair > ESPNOW_PAIR_INTERVAL_MS)
        {
            s_last_espnow_pair = now;
            s_pair_attempts++;
            console.printf("[%s] Pair attempt %d/%d\n", TAG, s_pair_attempts, ESPNOW_MAX_PAIR_ATTEMPTS);
            espnow_send_pair_request();
            if (s_pair_attempts >= ESPNOW_MAX_PAIR_ATTEMPTS)
            {
                s_pair_attempts = 0;
                s_pair_wait_until = now + 5000;
                console.printf("[%s] Max pair attempts, waiting 60s\n", TAG);
            }
        }
        return;
    }

    if (s_send_pending)
    {
        if (s_ack_received)
        {
            s_send_pending = false;
            s_gateway_connected = true;
            s_last_send_ms = millis();
        }
        else if (now > s_send_deadline)
        {
            if (s_send_retries_left > 0)
            {
                s_send_retries_left--;
                s_ack_received = false;
                if (espnow_send_data())
                    s_send_deadline = millis() + ESPNOW_ACK_TIMEOUT_MS;
                else
                    s_send_pending = false;
            }
            else
            {
                s_send_pending = false;
                s_gateway_connected = false;
                console.printf("[%s] Send failed, re-pairing\n", TAG);
                s_paired = false;
                s_pair_attempts = 0;
                s_last_espnow_pair = 0;
            }
        }
    }

    if (!s_send_pending && now - s_last_espnow_send > STATE_UPDATE_INTERVAL)
    {
        s_last_espnow_send = now;
        s_ack_received = false;
        if (espnow_send_data())
        {
            s_send_pending = true;
            s_send_deadline = now + ESPNOW_ACK_TIMEOUT_MS;
            s_send_retries_left = ESPNOW_SEND_RETRIES;
        }
    }

    if (now - s_last_timer_check > TIMER_CHECK_INTERVAL_MS)
    {
        s_last_timer_check = now;
        unsigned long epoch = get_synced_epoch();
        int8_t timer_action = epoch ? timer_check(epoch, s_timezone_offset) : -1;
        if (timer_action >= 0)
        {
            on_timer_fire((uint8_t)timer_action);
        }
    }

    if (now - s_last_cyclic_check > CYCLIC_CHECK_INTERVAL_MS)
    {
        s_last_cyclic_check = now;
        int8_t ca = cyclic_check(now, s_relay_state);
        if (ca == 1) { console.printf("[%s] Cyclic ON\n", TAG); set_relay(true); }
        else if (ca == -1) { console.printf("[%s] Cyclic OFF\n", TAG); set_relay(false); }
    }

    if (s_pulse_enabled && s_relay_state && (now - s_pulse_on_time > (unsigned long)s_pulse_duration_min * 60000))
    {
        console.printf("[%s] Pulse timeout (%d min), turning OFF\n", TAG, s_pulse_duration_min);
        set_relay(false);
        if (s_paired)
        {
            s_last_espnow_send = 0;
            if (espnow_send_data())
                s_last_send_ms = millis();
        }
    }

    if (now - s_last_heartbeat > HEARTBEAT_INTERVAL)
    {
        s_last_heartbeat = now;
        console.printf("[%s] RSSI=%d dBm  up=%lus\n", TAG, WiFi.RSSI(), (millis() - s_start_time) / 1000);
        if (s_paired)
            espnow_send_heartbeat();
    }

#ifdef LED_PIN
    static unsigned long last_led = 0;
    if (!s_led_enabled)
    {
        digitalWrite(LED_PIN, LED_OFF);
    }
    else if (s_config_portal_active)
    {
        digitalWrite(LED_PIN, LED_ON);
    }
    else if (WiFi.status() != WL_CONNECTED)
    {
        if (now - last_led >= LED_BLINK_WIFI_MS)
        {
            last_led = now;
            digitalWrite(LED_PIN, !digitalRead(LED_PIN));
        }
    }
    else if (!s_paired)
    {
        if (now - last_led >= LED_BLINK_GATEWAY_MS)
        {
            last_led = now;
            digitalWrite(LED_PIN, !digitalRead(LED_PIN));
        }
    }
    else
    {
        digitalWrite(LED_PIN, LED_OFF);
    }
#endif

}
